using System;

namespace P02.BonusScore
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Дадено е цяло число – начален брой точки.Върху него се начисляват бонус точки по правилата, описани по - долу.Да се напише програма,
            //    която пресмята бонус точките, които получава числото и общия брой точки(числото +бонуса).
            int num = int.Parse(Console.ReadLine());
            double bonus = 0;

            //•	Ако числото е до 100 включително, бонус точките са 5.
            if (num <= 100)
            {
                bonus = 5;
            }
            //•	Ако числото е по-голямо от 100, бонус точките са 20 % от числото.
            else if (num > 1000)
            {
                bonus = num * 0.10;
            }
            else
            {
                bonus = num * 0.20;
            }
            //•	Ако числото е по-голямо от 1000, бонус точките са 10 % от числото.
            //•	Допълнителни бонус точки(начисляват се отделно от предходните):
            //o За четно число  +1 т.
            if (num%2==0)
            {
                bonus = bonus + 1; // съкратено може bonus+=1;
            }
            //o За число, което завършва на 5  +2 т
            else if (num%10==5)
            {
                bonus += 2;
            }
            Console.WriteLine(bonus);
            Console.WriteLine(num + bonus);
        }
    }
}
